bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>DIG32K_WAKEUP_CTRL</name>
						<description>DIG32K_WAKEUP_CTRL.</description>
						<addressOffset>0xA8</addressOffset>
						<resetValue>0x033e13e8</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_en_platform_wakeup</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>dig_clk_src_sel</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>dig_512k_comp</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>dig_512k_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>dig_512k_div</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>dig_32k_comp</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>dig_32k_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dig_32k_div</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WIFI_BT_COEX_CTRL</name>
						<description>WIFI_BT_COEX_CTRL.</description>
						<addressOffset>0xAC</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>en_gpio_bt_coex</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>coex_bt_bw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>coex_bt_pti</name>
								<lsb>7</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>coex_bt_channel</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>UART_SIG_SEL_0</name>
						<description>UART_SIG_SEL_0.</description>
						<addressOffset>0xC0</addressOffset>
						<resetValue>0x76543210</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>uart_sig_7_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>uart_sig_6_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>uart_sig_5_sel</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>uart_sig_4_sel</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>uart_sig_3_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>uart_sig_2_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>uart_sig_1_sel</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>uart_sig_0_sel</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_LL</name>
						<description>DBG_SEL_LL.</description>
						<addressOffset>0xD0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_dbg_ll_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_LH</name>
						<description>DBG_SEL_LH.</description>
						<addressOffset>0xD4</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_dbg_lh_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_HL</name>
						<description>DBG_SEL_HL.</description>
						<addressOffset>0xD8</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_dbg_hl_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_HH</name>
						<description>DBG_SEL_HH.</description>
						<addressOffset>0xDC</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_dbg_hh_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>debug</name>
						<description>debug.</description>
						<addressOffset>0xE0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>debug_i</name>
								<lsb>1</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>debug_oe</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL0</name>
						<description>GPIO0, GPIO1 configuration</description>
						<addressOffset>0x100</addressOffset>
						<resetValue>0x11031103</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>real_gpio_1_func_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-only</access>
								<enumeratedValues>
									<name>GPIO1RealFunctionSelect</name>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_REG</name>
										<description>Function select is reg_gpio_1_func_sel</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_SDIO</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_RF</name>
										<value>12</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_JTAG</name>
										<value>14</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_CCI</name>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1FunctionSelect</name>
									<enumeratedValue>
										<name>SDIO_CMD</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SF_D2</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG1</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH1</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_1</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>ATEST_IP</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_1</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDI</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>real_gpio_0_func_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-only</access>
								<enumeratedValues>
									<name>GPIO0RealFunctionSelect</name>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_REG</name>
										<description>Function select is reg_gpio_0_func_sel</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_SDIO</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_RF</name>
										<value>12</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_JTAG</name>
										<value>14</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_CCI</name>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0FunctionSelect</name>
									<enumeratedValue>
										<name>SDIO_CLK</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SF_D1</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG0</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH0</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_0</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>ATEST_IN</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_0</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TMS</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control for GPIO0.</description>
								<enumeratedValues>
								    <name>GPIO0Driving</name>
								    <enumeratedValue>
									<name>disabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>GPIO0 input enable.</description>
								<enumeratedValues>
									<name>GPIO0InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
