bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_CFGCTL1</name>
						<description>GPIO2, GPIO3 configuration</description>
						<addressOffset>0x104</addressOffset>
						<resetValue>0x11031103</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>real_gpio_3_func_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-only</access>
								<enumeratedValues>
									<name>GPIO3RealFunctionSelect</name>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_REG</name>
										<description>Function select is reg_gpio_3_func_sel</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_SDIO</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_RF</name>
										<value>12</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_JTAG</name>
										<value>14</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_CCI</name>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3FunctionSelect</name>
									<enumeratedValue>
										<name>SDIO_DAT1</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_SCLK</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG3</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH3</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_3</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>ATEST_QP</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_3</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDO</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>real_gpio_2_func_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-only</access>
								<enumeratedValues>
									<name>GPIO2RealFunctionSelect</name>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_REG</name>
										<description>Function select is reg_gpio_2_func_sel</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_SDIO</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_RF</name>
										<value>12</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_JTAG</name>
										<value>14</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_CCI</name>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2FunctionSelect</name>
									<enumeratedValue>
										<name>SDIO_DAT0</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SF_D3</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_SS</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG2</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH2</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_2</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>ATEST_QN</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_2</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TCK</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL2</name>
						<description>GPIO4, GPIO5 configuration</description>
						<addressOffset>0x108</addressOffset>
						<resetValue>0x11031103</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>real_gpio_5_func_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-only</access>
								<enumeratedValues>
									<name>GPIO5RealFunctionSelect</name>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_REG</name>
										<description>Function select is reg_gpio_5_func_sel</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_SDIO</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_RF</name>
										<value>12</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_JTAG</name>
										<value>14</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_CCI</name>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5FunctionSelect</name>
									<enumeratedValue>
										<name>SDIO_DAT3</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG5</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH0</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_1</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH4</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_5</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDI</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>real_gpio_4_func_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
								<access>read-only</access>
								<enumeratedValues>
									<name>GPIO4RealFunctionSelect</name>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_REG</name>
										<description>Function select is reg_gpio_4_func_sel</description>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_SDIO</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_RF</name>
										<value>12</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_JTAG</name>
										<value>14</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GLB_GPIO_REAL_MODE_CCI</name>
										<value>15</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4FunctionSelect</name>
									<enumeratedValue>
										<name>SDIO_DAT2</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MISO_SPI_MOSI</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG4</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH4</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_0</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH1</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_4</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TMS</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
