bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_CFGCTL3</name>
						<description>GPIO6, GPIO7 configuration</description>
						<addressOffset>0x10C</addressOffset>
						<resetValue>0x0b030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_7_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_SCLK</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG7</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH2</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_3</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_7</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDO</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_SS</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG6</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH1</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_2</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH5</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_6</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TCK</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL4</name>
						<description>GPIO8, GPIO9 configuration</description>
						<addressOffset>0x110</addressOffset>
						<resetValue>0x0b030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_9_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG1</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH4</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_1</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH6_GPIP_CH7</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_9</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDI</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_MISO_SPI_MOSI</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG0</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH3</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_0</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_8</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TMS</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL5</name>
						<description>GPIO10, GPIO11 configuration</description>
						<addressOffset>0x114</addressOffset>
						<resetValue>0x0e030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_11_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_SCLK</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG3</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH1</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_3</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>IRLED_OUT_GPIP_CH10</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_11</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDO</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_SS</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG2</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH0</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_2</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>MICBIAS_GPIP_CH8_GPIP_CH9</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_10</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TCK</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
