bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_CFGCTL6</name>
						<description>GPIO12, GPIO13 configuration</description>
						<addressOffset>0x118</addressOffset>
						<resetValue>0x0b030e03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_13_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG5</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH3</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_1</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH3</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_13</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDI</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_MISO_SPI_MOSI</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG4</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH2</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_0</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH0_GPADC_VREF_EXT</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_12</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TMS</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL7</name>
						<description>GPIO14, GPIO15 configuration</description>
						<addressOffset>0x11C</addressOffset>
						<resetValue>0x0b030e03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_15_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_SCLK</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG7</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH0</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_3</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PSW_IRRCV_OUT_GPIP_CH11</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_15</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDO</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_SS</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG6</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH4</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_2</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>GPIP_CH2</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_14</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TCK</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL8</name>
						<description>GPIO16, GPIO17 configuration</description>
						<addressOffset>0x120</addressOffset>
						<resetValue>0x0e030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_17_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17FunctionSelect</name>
									<enumeratedValue>
										<name>SF_D3</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG1</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH2</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_1</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PMIP_DC_TP_OUT</name>
										<value>10</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_17</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDI</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16FunctionSelect</name>
									<enumeratedValue>
										<name>SPI_MISO_SPI_MOSI</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG0</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH1</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_0</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_16</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TMS</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
