bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_CFGCTL9</name>
						<description>GPIO18, GPIO19 configuration</description>
						<addressOffset>0x124</addressOffset>
						<resetValue>0x0b030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_19_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19FunctionSelect</name>
									<enumeratedValue>
										<name>SF_D1</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_SCLK</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG3</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH4</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_3</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_19</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDO</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18FunctionSelect</name>
									<enumeratedValue>
										<name>SF_D2</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_SS</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG2</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH3</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_2</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_18</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TCK</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL10</name>
						<description>GPIO20, GPIO21 configuration</description>
						<addressOffset>0x128</addressOffset>
						<resetValue>0x0b030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_21_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<description>Function select for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21FunctionSelect</name>
									<enumeratedValue>
										<name>SF_CS</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MOSI_SPI_MISO</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SDA</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG5</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH1</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_1</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_21</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TDI</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20FunctionSelect</name>
									<enumeratedValue>
										<name>SF_D0</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_MISO_SPI_MOSI</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG4</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH0</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_0</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_20</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TMS</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL11</name>
						<description>GPIO22, GPIO23 configuration</description>
						<addressOffset>0x12C</addressOffset>
						<resetValue>0x00030b03</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_23_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
								<description>Function select for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22FunctionSelect</name>
									<enumeratedValue>
										<name>SF_CLK_OUT</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SPI_SS</name>
										<value>4</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>I2C_SCL</name>
										<value>6</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>UART_SIG6</name>
										<value>7</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>PWM_CH2</name>
										<value>8</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>FEM_GPIO_2</name>
										<value>9</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>SWGPIO_22</name>
										<value>11</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>E21_TCK</name>
										<value>14</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
