bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_CFGCTL12</name>
						<description>GPIO24, GPIO25 configuration</description>
						<addressOffset>0x130</addressOffset>
						<resetValue>0x00030023</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_25_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL13</name>
						<description>GPIO26, GPIO27 configuration</description>
						<addressOffset>0x134</addressOffset>
						<resetValue>0x00030003</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_27_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Pull Down Resistor for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Pull Up Resistor for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Driving control enabled for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Schmitt trigger enabled for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Input enable for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL14</name>
						<description>GPIO28 configuration</description>
						<addressOffset>0x138</addressOffset>
						<resetValue>0x00000003</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_28_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Pull Down Resistor for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28PullDownResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Pull Up Resistor for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28PullUpResistor</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
								<description>Driving control enabled for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28Driving</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Schmitt trigger enabled for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28Schmitt</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Input enable for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28InputEnabled</name>
									<enumeratedValue>
										<name>disabled</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>enabled</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
