bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_INT_MASK1</name>
						<description>Interrupt masking register. The SDK limits the GPIO pins to &lt; 32 although the docs do not mention more than 28 GPIO pins.</description>
						<addressOffset>0x1A0</addressOffset>
						<resetValue>0xffffffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_0_mask</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Mask register for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_mask</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Mask register for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_mask</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<description>Mask register for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_mask</name>
								<lsb>3</lsb>
								<msb>3</msb>
								<description>Mask register for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_mask</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Mask register for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_mask</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Mask register for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_mask</name>
								<lsb>6</lsb>
								<msb>6</msb>
								<description>Mask register for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_mask</name>
								<lsb>7</lsb>
								<msb>7</msb>
								<description>Mask register for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<description>Mask register for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
								<description>Mask register for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_mask</name>
								<lsb>10</lsb>
								<msb>10</msb>
								<description>Mask register for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
								<description>Mask register for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_mask</name>
								<lsb>12</lsb>
								<msb>12</msb>
								<description>Mask register for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_mask</name>
								<lsb>13</lsb>
								<msb>13</msb>
								<description>Mask register for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_mask</name>
								<lsb>14</lsb>
								<msb>14</msb>
								<description>Mask register for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_mask</name>
								<lsb>15</lsb>
								<msb>15</msb>
								<description>Mask register for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_mask</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Mask register for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_mask</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Mask register for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_mask</name>
								<lsb>18</lsb>
								<msb>18</msb>
								<description>Mask register for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_mask</name>
								<lsb>19</lsb>
								<msb>19</msb>
								<description>Mask register for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_mask</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Mask register for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_mask</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Mask register for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_mask</name>
								<lsb>22</lsb>
								<msb>22</msb>
								<description>Mask register for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_mask</name>
								<lsb>23</lsb>
								<msb>23</msb>
								<description>Mask register for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_mask</name>
								<lsb>24</lsb>
								<msb>24</msb>
								<description>Mask register for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_mask</name>
								<lsb>25</lsb>
								<msb>25</msb>
								<description>Mask register for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_mask</name>
								<lsb>26</lsb>
								<msb>26</msb>
								<description>Mask register for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_mask</name>
								<lsb>27</lsb>
								<msb>27</msb>
								<description>Mask register for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_mask</name>
								<lsb>28</lsb>
								<msb>28</msb>
								<description>Mask register for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28Mask</name>
									<enumeratedValue>
										<name>unmasked</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>masked</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
