bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_INT_STAT1</name>
						<description>Interrupt status register. The SDK limits the GPIO pins to &lt; 32 although the docs do not mention more than 28 GPIO pins.</description>
						<addressOffset>0x1A8</addressOffset>
						<access>read-only</access>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_0_interrupt_status</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Interrupt status register for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_interrupt_status</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Interrupt status register for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_interrupt_status</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<description>Interrupt status register for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_interrupt_status</name>
								<lsb>3</lsb>
								<msb>3</msb>
								<description>Interrupt status register for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_interrupt_status</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Interrupt status register for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_interrupt_status</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Interrupt status register for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_interrupt_status</name>
								<lsb>6</lsb>
								<msb>6</msb>
								<description>Interrupt status register for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_interrupt_status</name>
								<lsb>7</lsb>
								<msb>7</msb>
								<description>Interrupt status register for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_interrupt_status</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<description>Interrupt status register for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_interrupt_status</name>
								<lsb>9</lsb>
								<msb>9</msb>
								<description>Interrupt status register for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_interrupt_status</name>
								<lsb>10</lsb>
								<msb>10</msb>
								<description>Interrupt status register for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_interrupt_status</name>
								<lsb>11</lsb>
								<msb>11</msb>
								<description>Interrupt status register for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_interrupt_status</name>
								<lsb>12</lsb>
								<msb>12</msb>
								<description>Interrupt status register for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_interrupt_status</name>
								<lsb>13</lsb>
								<msb>13</msb>
								<description>Interrupt status register for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_interrupt_status</name>
								<lsb>14</lsb>
								<msb>14</msb>
								<description>Interrupt status register for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_interrupt_status</name>
								<lsb>15</lsb>
								<msb>15</msb>
								<description>Interrupt status register for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_interrupt_status</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Interrupt status register for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_interrupt_status</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Interrupt status register for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_interrupt_status</name>
								<lsb>18</lsb>
								<msb>18</msb>
								<description>Interrupt status register for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_interrupt_status</name>
								<lsb>19</lsb>
								<msb>19</msb>
								<description>Interrupt status register for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_interrupt_status</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Interrupt status register for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_interrupt_status</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Interrupt status register for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_interrupt_status</name>
								<lsb>22</lsb>
								<msb>22</msb>
								<description>Interrupt status register for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_interrupt_status</name>
								<lsb>23</lsb>
								<msb>23</msb>
								<description>Interrupt status register for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_interrupt_status</name>
								<lsb>24</lsb>
								<msb>24</msb>
								<description>Interrupt status register for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_interrupt_status</name>
								<lsb>25</lsb>
								<msb>25</msb>
								<description>Interrupt status register for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_interrupt_status</name>
								<lsb>26</lsb>
								<msb>26</msb>
								<description>Interrupt status register for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_interrupt_status</name>
								<lsb>27</lsb>
								<msb>27</msb>
								<description>Interrupt status register for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_interrupt_status</name>
								<lsb>28</lsb>
								<msb>28</msb>
								<description>Interrupt status register for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28InterruptStatus</name>
									<enumeratedValue>
										<name>reset</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>set</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
