bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_INT_CLR1</name>
						<description>Interrupt clearing register.</description>
						<addressOffset>0x1B0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_0_interrupt_clear</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<description>Interrupt clearing register for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_interrupt_clear</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<description>Interrupt clearing register for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_interrupt_clear</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<description>Interrupt clearing register for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_interrupt_clear</name>
								<lsb>3</lsb>
								<msb>3</msb>
								<description>Interrupt clearing register for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_interrupt_clear</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<description>Interrupt clearing register for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_interrupt_clear</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Interrupt clearing register for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_interrupt_clear</name>
								<lsb>6</lsb>
								<msb>6</msb>
								<description>Interrupt clearing register for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_interrupt_clear</name>
								<lsb>7</lsb>
								<msb>7</msb>
								<description>Interrupt clearing register for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_interrupt_clear</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<description>Interrupt clearing register for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_interrupt_clear</name>
								<lsb>9</lsb>
								<msb>9</msb>
								<description>Interrupt clearing register for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_interrupt_clear</name>
								<lsb>10</lsb>
								<msb>10</msb>
								<description>Interrupt clearing register for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_interrupt_clear</name>
								<lsb>11</lsb>
								<msb>11</msb>
								<description>Interrupt clearing register for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_interrupt_clear</name>
								<lsb>12</lsb>
								<msb>12</msb>
								<description>Interrupt clearing register for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_interrupt_clear</name>
								<lsb>13</lsb>
								<msb>13</msb>
								<description>Interrupt clearing register for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_interrupt_clear</name>
								<lsb>14</lsb>
								<msb>14</msb>
								<description>Interrupt clearing register for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_interrupt_clear</name>
								<lsb>15</lsb>
								<msb>15</msb>
								<description>Interrupt clearing register for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_interrupt_clear</name>
								<lsb>16</lsb>
								<msb>16</msb>
								<description>Interrupt clearing register for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_interrupt_clear</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Interrupt clearing register for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_interrupt_clear</name>
								<lsb>18</lsb>
								<msb>18</msb>
								<description>Interrupt clearing register for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_interrupt_clear</name>
								<lsb>19</lsb>
								<msb>19</msb>
								<description>Interrupt clearing register for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_interrupt_clear</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Interrupt clearing register for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_interrupt_clear</name>
								<lsb>21</lsb>
								<msb>21</msb>
								<description>Interrupt clearing register for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_interrupt_clear</name>
								<lsb>22</lsb>
								<msb>22</msb>
								<description>Interrupt clearing register for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_interrupt_clear</name>
								<lsb>23</lsb>
								<msb>23</msb>
								<description>Interrupt clearing register for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_interrupt_clear</name>
								<lsb>24</lsb>
								<msb>24</msb>
								<description>Interrupt clearing register for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_interrupt_clear</name>
								<lsb>25</lsb>
								<msb>25</msb>
								<description>Interrupt clearing register for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_interrupt_clear</name>
								<lsb>26</lsb>
								<msb>26</msb>
								<description>Interrupt clearing register for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_interrupt_clear</name>
								<lsb>27</lsb>
								<msb>27</msb>
								<description>Interrupt clearing register for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_interrupt_clear</name>
								<lsb>28</lsb>
								<msb>28</msb>
								<description>Interrupt clearing register for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28InterruptClear</name>
									<enumeratedValue>
										<name>no_clear</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>clear</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
