bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_INT_MODE_SET1</name>
						<description>GPIO interrupt trigger and control register for GPIO0-GPIO9.</description>
						<addressOffset>0x1C0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_0_interrupt_trigger_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
								<description>Interrupt trigger mode register for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_0_interrupt_control_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<description>Interrupt control mode register for GPIO0.</description>
								<enumeratedValues>
									<name>GPIO0ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_interrupt_trigger_mode</name>
								<lsb>3</lsb>
								<msb>4</msb>
								<description>Interrupt trigger mode register for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_1_interrupt_control_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Interrupt control mode register for GPIO1.</description>
								<enumeratedValues>
									<name>GPIO1ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_interrupt_trigger_mode</name>
								<lsb>6</lsb>
								<msb>7</msb>
								<description>Interrupt trigger mode register for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_2_interrupt_control_mode</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<description>Interrupt control mode register for GPIO2.</description>
								<enumeratedValues>
									<name>GPIO2ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_interrupt_trigger_mode</name>
								<lsb>9</lsb>
								<msb>10</msb>
								<description>Interrupt trigger mode register for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_3_interrupt_control_mode</name>
								<lsb>11</lsb>
								<msb>11</msb>
								<description>Interrupt control mode register for GPIO3.</description>
								<enumeratedValues>
									<name>GPIO3ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_interrupt_trigger_mode</name>
								<lsb>12</lsb>
								<msb>13</msb>
								<description>Interrupt trigger mode register for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_4_interrupt_control_mode</name>
								<lsb>14</lsb>
								<msb>14</msb>
								<description>Interrupt control mode register for GPIO4.</description>
								<enumeratedValues>
									<name>GPIO4ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_interrupt_trigger_mode</name>
								<lsb>15</lsb>
								<msb>16</msb>
								<description>Interrupt trigger mode register for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_5_interrupt_control_mode</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Interrupt control mode register for GPIO5.</description>
								<enumeratedValues>
									<name>GPIO5ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_interrupt_trigger_mode</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Interrupt trigger mode register for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_6_interrupt_control_mode</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Interrupt control mode register for GPIO6.</description>
								<enumeratedValues>
									<name>GPIO6ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_interrupt_trigger_mode</name>
								<lsb>21</lsb>
								<msb>22</msb>
								<description>Interrupt trigger mode register for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_7_interrupt_control_mode</name>
								<lsb>23</lsb>
								<msb>23</msb>
								<description>Interrupt control mode register for GPIO7.</description>
								<enumeratedValues>
									<name>GPIO7ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_interrupt_trigger_mode</name>
								<lsb>24</lsb>
								<msb>25</msb>
								<description>Interrupt trigger mode register for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_8_interrupt_control_mode</name>
								<lsb>26</lsb>
								<msb>26</msb>
								<description>Interrupt control mode register for GPIO8.</description>
								<enumeratedValues>
									<name>GPIO8ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_interrupt_trigger_mode</name>
								<lsb>27</lsb>
								<msb>28</msb>
								<description>Interrupt trigger mode register for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_9_interrupt_control_mode</name>
								<lsb>29</lsb>
								<msb>29</msb>
								<description>Interrupt control mode register for GPIO9.</description>
								<enumeratedValues>
									<name>GPIO9ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
