bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_INT_MODE_SET2</name>
						<description>GPIO interrupt trigger and control register for GPIO10-GPIO19.</description>
						<addressOffset>0x1C4</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_10_interrupt_trigger_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
								<description>Interrupt trigger mode register for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_10_interrupt_control_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<description>Interrupt control mode register for GPIO10.</description>
								<enumeratedValues>
									<name>GPIO10ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_interrupt_trigger_mode</name>
								<lsb>3</lsb>
								<msb>4</msb>
								<description>Interrupt trigger mode register for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_11_interrupt_control_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Interrupt control mode register for GPIO11.</description>
								<enumeratedValues>
									<name>GPIO11ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_interrupt_trigger_mode</name>
								<lsb>6</lsb>
								<msb>7</msb>
								<description>Interrupt trigger mode register for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_12_interrupt_control_mode</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<description>Interrupt control mode register for GPIO12.</description>
								<enumeratedValues>
									<name>GPIO12ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_interrupt_trigger_mode</name>
								<lsb>9</lsb>
								<msb>10</msb>
								<description>Interrupt trigger mode register for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_13_interrupt_control_mode</name>
								<lsb>11</lsb>
								<msb>11</msb>
								<description>Interrupt control mode register for GPIO13.</description>
								<enumeratedValues>
									<name>GPIO13ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_interrupt_trigger_mode</name>
								<lsb>12</lsb>
								<msb>13</msb>
								<description>Interrupt trigger mode register for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_14_interrupt_control_mode</name>
								<lsb>14</lsb>
								<msb>14</msb>
								<description>Interrupt control mode register for GPIO14.</description>
								<enumeratedValues>
									<name>GPIO14ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_interrupt_trigger_mode</name>
								<lsb>15</lsb>
								<msb>16</msb>
								<description>Interrupt trigger mode register for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_15_interrupt_control_mode</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Interrupt control mode register for GPIO15.</description>
								<enumeratedValues>
									<name>GPIO15ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_interrupt_trigger_mode</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Interrupt trigger mode register for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_16_interrupt_control_mode</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Interrupt control mode register for GPIO16.</description>
								<enumeratedValues>
									<name>GPIO16ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_interrupt_trigger_mode</name>
								<lsb>21</lsb>
								<msb>22</msb>
								<description>Interrupt trigger mode register for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_17_interrupt_control_mode</name>
								<lsb>23</lsb>
								<msb>23</msb>
								<description>Interrupt control mode register for GPIO17.</description>
								<enumeratedValues>
									<name>GPIO17ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_interrupt_trigger_mode</name>
								<lsb>24</lsb>
								<msb>25</msb>
								<description>Interrupt trigger mode register for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_18_interrupt_control_mode</name>
								<lsb>26</lsb>
								<msb>26</msb>
								<description>Interrupt control mode register for GPIO18.</description>
								<enumeratedValues>
									<name>GPIO18ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_interrupt_trigger_mode</name>
								<lsb>27</lsb>
								<msb>28</msb>
								<description>Interrupt trigger mode register for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_19_interrupt_control_mode</name>
								<lsb>29</lsb>
								<msb>29</msb>
								<description>Interrupt control mode register for GPIO19.</description>
								<enumeratedValues>
									<name>GPIO19ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
