bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>GPIO_INT_MODE_SET3</name>
						<description>GPIO interrupt trigger and control register for GPIO20-GPIO29.</description>
						<addressOffset>0x1C8</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_gpio_20_interrupt_trigger_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
								<description>Interrupt trigger mode register for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_20_interrupt_control_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<description>Interrupt control mode register for GPIO20.</description>
								<enumeratedValues>
									<name>GPIO20ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_interrupt_trigger_mode</name>
								<lsb>3</lsb>
								<msb>4</msb>
								<description>Interrupt trigger mode register for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_21_interrupt_control_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<description>Interrupt control mode register for GPIO21.</description>
								<enumeratedValues>
									<name>GPIO21ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_interrupt_trigger_mode</name>
								<lsb>6</lsb>
								<msb>7</msb>
								<description>Interrupt trigger mode register for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_22_interrupt_control_mode</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<description>Interrupt control mode register for GPIO22.</description>
								<enumeratedValues>
									<name>GPIO22ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_interrupt_trigger_mode</name>
								<lsb>9</lsb>
								<msb>10</msb>
								<description>Interrupt trigger mode register for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_23_interrupt_control_mode</name>
								<lsb>11</lsb>
								<msb>11</msb>
								<description>Interrupt control mode register for GPIO23.</description>
								<enumeratedValues>
									<name>GPIO23ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_interrupt_trigger_mode</name>
								<lsb>12</lsb>
								<msb>13</msb>
								<description>Interrupt trigger mode register for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_24_interrupt_control_mode</name>
								<lsb>14</lsb>
								<msb>14</msb>
								<description>Interrupt control mode register for GPIO24.</description>
								<enumeratedValues>
									<name>GPIO24ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_interrupt_trigger_mode</name>
								<lsb>15</lsb>
								<msb>16</msb>
								<description>Interrupt trigger mode register for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_25_interrupt_control_mode</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<description>Interrupt control mode register for GPIO25.</description>
								<enumeratedValues>
									<name>GPIO25ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_interrupt_trigger_mode</name>
								<lsb>18</lsb>
								<msb>19</msb>
								<description>Interrupt trigger mode register for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_26_interrupt_control_mode</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<description>Interrupt control mode register for GPIO26.</description>
								<enumeratedValues>
									<name>GPIO26ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_interrupt_trigger_mode</name>
								<lsb>21</lsb>
								<msb>22</msb>
								<description>Interrupt trigger mode register for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_27_interrupt_control_mode</name>
								<lsb>23</lsb>
								<msb>23</msb>
								<description>Interrupt control mode register for GPIO27.</description>
								<enumeratedValues>
									<name>GPIO27ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_interrupt_trigger_mode</name>
								<lsb>24</lsb>
								<msb>25</msb>
								<description>Interrupt trigger mode register for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_28_interrupt_control_mode</name>
								<lsb>26</lsb>
								<msb>26</msb>
								<description>Interrupt control mode register for GPIO28.</description>
								<enumeratedValues>
									<name>GPIO28ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_29_interrupt_trigger_mode</name>
								<lsb>27</lsb>
								<msb>28</msb>
								<description>Interrupt trigger mode register for GPIO29.</description>
								<enumeratedValues>
									<name>GPIO29TriggerMode</name>
									<enumeratedValue>
										<name>negative_pulse</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_pulse</name>
										<value>1</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>negative_level</name>
										<value>2</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>positive_level</name>
										<value>3</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
							<field>
								<name>reg_gpio_29_interrupt_control_mode</name>
								<lsb>29</lsb>
								<msb>29</msb>
								<description>Interrupt control mode register for GPIO29.</description>
								<enumeratedValues>
									<name>GPIO29ControlMode</name>
									<enumeratedValue>
										<name>synchronous</name>
										<value>0</value>
									</enumeratedValue>
									<enumeratedValue>
										<name>asynchronous</name>
										<value>1</value>
									</enumeratedValue>
								</enumeratedValues>
							</field>
						</fields>
					</register>
					<register>
						<name>led_driver</name>
						<description>led_driver.</description>
						<addressOffset>0x224</addressOffset>
						<resetValue>0x00000080</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>pu_leddrv</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ir_rx_gpio_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>leddrv_ibias</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>led_din_polarity_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>led_din_sel</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>led_din_reg</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_ctrl</name>
						<description>gpdac_ctrl.</description>
						<addressOffset>0x308</addressOffset>
						<resetValue>0x00000003</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpdac_reserved</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpdac_test_sel</name>
								<lsb>9</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gpdac_ref_sel</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpdac_test_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gpdacb_rstn_ana</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdaca_rstn_ana</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_actrl</name>
						<description>gpdac_actrl.</description>
						<addressOffset>0x30C</addressOffset>
						<resetValue>0x000c0000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpdac_a_outmux</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpdac_a_rng</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_ioa_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_a_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_bctrl</name>
						<description>gpdac_bctrl.</description>
						<addressOffset>0x310</addressOffset>
						<resetValue>0x000c0000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpdac_b_outmux</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpdac_b_rng</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_iob_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_b_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_data</name>
						<description>gpdac_data.</description>
						<addressOffset>0x314</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpdac_a_data</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gpdac_b_data</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_0</name>
						<description>tzc_glb_ctrl_0.</description>
						<addressOffset>0xF00</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_glb_clk_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_mbist_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_dbg_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_bmx_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_l2c_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_sram_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_misc_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_ungated_ap_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_sys_reset_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_cpu_reset_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_ctrl_pwron_rst_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s30_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s01_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s00_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_glb_ctrl_1</name>
						<description>tzc_glb_ctrl_1.</description>
						<addressOffset>0xF04</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_glb_swrst_s1f_lock</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1e_lock</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1d_lock</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1c_lock</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1b_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s1a_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s19_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s18_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s17_lock</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s16_lock</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s15_lock</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s14_lock</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s13_lock</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s12_lock</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s11_lock</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s10_lock</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2f_lock</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2e_lock</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2d_lock</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2c_lock</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2b_lock</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s2a_lock</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s29_lock</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s28_lock</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s27_lock</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s26_lock</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s25_lock</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s24_lock</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s23_lock</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s22_lock</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s21_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_glb_swrst_s20_lock</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
