bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>trx_gain1</name>
						<description>gain control1</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>gc_tbb_boost</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gc_tbb</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gc_tmx</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>gc_rbb2</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gc_rbb1</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gc_rmxgm</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gc_lna</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>trx_gain_hw</name>
						<description>trx gain hardware readback</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>gc_tbb_boost_hw</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gc_tbb_hw</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gc_tmx_hw</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>gc_rbb2_hw</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gc_rbb1_hw</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gc_rmxgm_hw</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gc_lna_hw</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ten_dc</name>
						<description>dc test register</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>ten_lodist</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ten_lf</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>ten_pfdcp</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ten_vco</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>ten_dac_q</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ten_dac_i</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ten_adc</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ten_tbb</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ten_atest</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ten_bq</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ten_tia</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ten_tmx</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ten_pa</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ten_rrf_1</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ten_rrf_0</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ten_clkpll_sfreg</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ten_clkpll</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>dc_tp_clkpll_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>dc_tp_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tmux</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ten_dig</name>
						<description>digital test register</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>rf_dtest_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>dtest_pull_down</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>dten_lo_fref</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>dten_lo_fsdm</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>dten_clkpll_fin</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>dten_clkpll_fref</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>dten_clkpll_fsdm</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dten_clkpll_clk32m</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>dten_clkpll_clk96m</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>dten_clkpll_postdiv_clk</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ten_ac</name>
						<description>ac test register</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>atest_in_en_i</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>atest_in_en_q</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>atest_out_en_i</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>atest_out_en_q</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>atest_gain_r5</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>atest_gain_r6</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>atest_gain_r7</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>atest_gain_r8</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>atest_gain_r9</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>atest_in_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>atest_in_trx_sw</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>atest_dac_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>atest_op_cc</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pmip_mv2aon</name>
						<description>pmip_mv2aon.</description>
						<addressOffset>0x5C</addressOffset>
					</register>
					<register>
						<name>cip</name>
						<description>RX normal bias mode registers</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>vg13_sel</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>vg11_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pa1</name>
						<description>pa1.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>pa_att_gc</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>pa_pwrmx_bm</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>pa_pwrmx_dac_pn_switch</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pa_pwrmx_osdac</name>
								<lsb>18</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pa_lz_bias_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pa_ib_fix</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pa_half_on</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pa_vbcas</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pa_vbcore</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pa_iet</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pa_etb_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pa_iaq</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pa2</name>
						<description>RX normal bias mode registers</description>
						<addressOffset>0x68</addressOffset>
						<fields>
							<field>
								<name>pa_ib_fix_hw</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pa_half_on_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pa_vbcas_hw</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pa_vbcore_hw</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pa_iet_hw</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pa_etb_en_hw</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tmx</name>
						<description>tmx.</description>
						<addressOffset>0x6C</addressOffset>
						<fields>
							<field>
								<name>tx_tsense_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tmx_bm_cas_bulk</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tmx_bm_cas</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tmx_bm_sw</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tmx_cs</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tbb</name>
						<description>tbb.</description>
						<addressOffset>0x70</addressOffset>
						<fields>
							<field>
								<name>tbb_tosdac_i</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tbb_tosdac_q</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tbb_atest_out_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>tbb_iq_bias_short</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tbb_cflt</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tbb_vcm</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tbb_bm_cg</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>tbb_bm_sf</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lna</name>
						<description>lna.</description>
						<addressOffset>0x74</addressOffset>
						<fields>
							<field>
								<name>lna_lg_gsel</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>lna_cap_lg</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>lna_rfb_match</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>lna_load_csw_hw</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lna_load_csw</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lna_bm_hw</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lna_bm</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rmxgm</name>
						<description>rmxgm.</description>
						<addressOffset>0x78</addressOffset>
						<fields>
							<field>
								<name>rmxgm_10m_mode_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rmxgm_bm</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rmx_bm</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb1</name>
						<description>rbb1.</description>
						<addressOffset>0x7C</addressOffset>
						<fields>
							<field>
								<name>rosdac_range</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rosdac_i_hw</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rosdac_q_hw</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rosdac_i</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rosdac_q</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb2</name>
						<description>rbb2.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>rbb_cap1_fc_i</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_cap1_fc_q</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_i</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_q</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb3</name>
						<description>rbb3.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>pwr_det_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rxiqcal_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rbb_bw</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rbb_tia_iqbias_short</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_bq_iqbias_short</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rbb_vcm</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rbb_bm_op</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rbb_deq</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>rbb_bt_fif_tune</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rbb_bt_mode</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rbb_bt_mode_hw</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb4</name>
						<description>rbb4.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>pkdet_out_latch</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>pkdet_out_raw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rbb_pkdet_en_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rbb_pkdet_out_rstn_hw</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rbb_pkdet_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rbb_pkdet_out_rstn</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rbb_pkdet_vth</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adda1</name>
						<description>adda1.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>adda_ldo_dvdd_sel_hw</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adda_ldo_dvdd_sel</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>adda_ldo_byps</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>dac_clk_sync_inv</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>dac_rccalsel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dac_clk_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>dac_bias_sel</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>dac_dvdd_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adda2</name>
						<description>adda2.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>adc_clk_div_sel</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>adc_clk_inv</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>adc_clk_sync_inv</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>adc_gt_rm</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adc_sar_ascal_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>adc_dvdd_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adc_dly_ctl</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>adc_vref_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>vco1</name>
						<description>vco1.</description>
						<addressOffset>0xA0</addressOffset>
						<fields>
							<field>
								<name>lo_vco_idac_cw_hw</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_hw</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>vco2</name>
						<description>vco2.</description>
						<addressOffset>0xA4</addressOffset>
						<fields>
							<field>
								<name>acal_inc_en_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>acal_vco_ud</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>acal_vref_cw</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lo_vco_short_idac_filter</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>lo_vco_short_vbias_filter</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_vco_idac_boot</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>lo_vco_vbias_cw</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>vco3</name>
						<description>vco3.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>fcal_cnt_op</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>fcal_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>vco4</name>
						<description>vco4.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>fcal_inc_vctrl_ud</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>fcal_cnt_rdy</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>fcal_inc_large_range</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>fcal_inc_en_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>fcal_cnt_start</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pfdcp</name>
						<description>pfdcp.</description>
						<addressOffset>0xB0</addressOffset>
						<fields>
							<field>
								<name>lo_pfd_rst_csd_hw</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>lo_pfd_rst_csd</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>lo_pfd_rvdd_boost</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>lo_cp_hiz</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_cp_opamp_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>lo_cp_ota_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>lo_cp_startup_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lo_cp_sel_hw</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>lo_cp_sel</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo</name>
						<description>lo.</description>
						<addressOffset>0xB4</addressOffset>
						<fields>
							<field>
								<name>lo_slipped_up</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>lo_slipped_dn</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_lf_r4_short</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>lo_lf_r4</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_lf_cz</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_lf_rz</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_lf_cz_hw</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_lf_r4_hw</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_lf_rz_hw</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
