bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>dfe_ctrl_16</name>
						<description>dfe_ctrl_16.</description>
						<addressOffset>0x640</addressOffset>
						<fields>
							<field>
								<name>rf_tbb_ind_gc7</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc6</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc5</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc4</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc3</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc2</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc1</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc0</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_17</name>
						<description>dfe_ctrl_17.</description>
						<addressOffset>0x644</addressOffset>
						<fields>
							<field>
								<name>rf_tbb_ind_gc15</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc14</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc13</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc12</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc11</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc10</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc9</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc8</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_18</name>
						<description>dfe_ctrl_18.</description>
						<addressOffset>0x648</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_qdb_ble_gc2</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_ble_gc1</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_ble_gc0</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>GPIP</name>
				<description>Universal DAC/ADC/ACOMP interface control</description>
				<baseAddress>0x40002000</baseAddress>
				<groupName>GPIP</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>gpadc_config</name>
						<description>gpadc_config.</description>
						<addressOffset>0x0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rsvd_31_24</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_fifo_thl</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gpadc_fifo_data_count</name>
								<lsb>16</lsb>
								<msb>21</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_fifo_underrun_mask</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_fifo_overrun_mask</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gpadc_rdy_mask</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>gpadc_fifo_underrun_clr</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>gpadc_fifo_overrun_clr</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_rdy_clr</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpadc_fifo_underrun</name>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_fifo_overrun</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_rdy</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_fifo_full</name>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_fifo_ne</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_fifo_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpadc_dma_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_dma_rdata</name>
						<description>gpadc_dma_rdata.</description>
						<addressOffset>0x4</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>rsvd_31_26</name>
								<lsb>26</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_dma_rdata</name>
								<lsb>0</lsb>
								<msb>25</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_config</name>
						<description>gpdac_config.</description>
						<addressOffset>0x40</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rsvd_31_24</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpdac_ch_b_sel</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gpdac_ch_a_sel</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_mode</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>dsm_mode</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpdac_en2</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_dma_config</name>
						<description>gpdac_dma_config.</description>
						<addressOffset>0x44</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpdac_dma_format</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpdac_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_dma_wdata</name>
						<description>gpdac_dma_wdata.</description>
						<addressOffset>0x48</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>write-only</access>
						<fields>
							<field>
								<name>gpdac_dma_wdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_tx_fifo_status</name>
						<description>gpdac_tx_fifo_status.</description>
						<addressOffset>0x4C</addressOffset>
						<resetValue>0x00000040</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>TxFifoWrPtr</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>TxFifoRdPtr</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tx_cs</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_fifo_full</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tx_fifo_empty</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
