bouffalolab/bl-pac/bl602/bl602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>SEC_DBG</name>
				<description>SEC_DBG.</description>
				<baseAddress>0x40003000</baseAddress>
				<groupName>SEC_DBG</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>sd_chip_id_low</name>
						<description>sd_chip_id_low.</description>
						<addressOffset>0x0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>sd_chip_id_low</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_chip_id_high</name>
						<description>sd_chip_id_high.</description>
						<addressOffset>0x4</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>sd_chip_id_high</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_wifi_mac_low</name>
						<description>sd_wifi_mac_low.</description>
						<addressOffset>0x8</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>sd_wifi_mac_low</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_wifi_mac_high</name>
						<description>sd_wifi_mac_high.</description>
						<addressOffset>0xC</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>sd_wifi_mac_high</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_dbg_pwd_low</name>
						<description>sd_dbg_pwd_low.</description>
						<addressOffset>0x10</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>sd_dbg_pwd_low</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_dbg_pwd_high</name>
						<description>sd_dbg_pwd_high.</description>
						<addressOffset>0x14</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>sd_dbg_pwd_high</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_status</name>
						<description>sd_status.</description>
						<addressOffset>0x18</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>sd_dbg_ena</name>
								<lsb>28</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>sd_dbg_mode</name>
								<lsb>24</lsb>
								<msb>27</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>sd_dbg_pwd_cnt</name>
								<lsb>4</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>sd_dbg_cci_clk_sel</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sd_dbg_cci_read_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>sd_dbg_pwd_trig</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sd_dbg_pwd_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>sd_dbg_reserved</name>
						<description>sd_dbg_reserved.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>sd_dbg_reserved</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>SEC_ENG</name>
				<description>SEC_ENG.</description>
				<baseAddress>0x40004000</baseAddress>
				<groupName>SEC_ENG</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>se_sha_0_ctrl</name>
						<description>se_sha_0_ctrl.</description>
						<addressOffset>0x0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_sha_0_msg_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_sha_0_link_mode</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_sha_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_sha_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_sha_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_sha_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_sha_0_hash_sel</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>se_sha_0_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>se_sha_0_mode</name>
								<lsb>2</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>se_sha_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_sha_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_msa</name>
						<description>se_sha_0_msa.</description>
						<addressOffset>0x4</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_sha_0_msa</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_status</name>
						<description>se_sha_0_status.</description>
						<addressOffset>0x8</addressOffset>
						<resetValue>0x00000041</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_endian</name>
						<description>se_sha_0_endian.</description>
						<addressOffset>0xC</addressOffset>
						<resetValue>0x00000001</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_sha_0_dout_endian</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_0</name>
						<description>se_sha_0_hash_l_0.</description>
						<addressOffset>0x10</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_1</name>
						<description>se_sha_0_hash_l_1.</description>
						<addressOffset>0x14</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_2</name>
						<description>se_sha_0_hash_l_2.</description>
						<addressOffset>0x18</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_3</name>
						<description>se_sha_0_hash_l_3.</description>
						<addressOffset>0x1C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_4</name>
						<description>se_sha_0_hash_l_4.</description>
						<addressOffset>0x20</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_5</name>
						<description>se_sha_0_hash_l_5.</description>
						<addressOffset>0x24</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_6</name>
						<description>se_sha_0_hash_l_6.</description>
						<addressOffset>0x28</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_l_7</name>
						<description>se_sha_0_hash_l_7.</description>
						<addressOffset>0x2C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_l_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_0</name>
						<description>se_sha_0_hash_h_0.</description>
						<addressOffset>0x30</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_1</name>
						<description>se_sha_0_hash_h_1.</description>
						<addressOffset>0x34</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_2</name>
						<description>se_sha_0_hash_h_2.</description>
						<addressOffset>0x38</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_3</name>
						<description>se_sha_0_hash_h_3.</description>
						<addressOffset>0x3C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_4</name>
						<description>se_sha_0_hash_h_4.</description>
						<addressOffset>0x40</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_5</name>
						<description>se_sha_0_hash_h_5.</description>
						<addressOffset>0x44</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_6</name>
						<description>se_sha_0_hash_h_6.</description>
						<addressOffset>0x48</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_hash_h_7</name>
						<description>se_sha_0_hash_h_7.</description>
						<addressOffset>0x4C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_sha_0_hash_h_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_link</name>
						<description>se_sha_0_link.</description>
						<addressOffset>0x50</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_sha_0_lca</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_sha_0_ctrl_prot</name>
						<description>se_sha_0_ctrl_prot.</description>
						<addressOffset>0xFC</addressOffset>
						<resetValue>0x00000007</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_sha_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_sha_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_sha_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_ctrl</name>
						<description>se_aes_0_ctrl.</description>
						<addressOffset>0x100</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_msg_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_aes_0_link_mode</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_aes_0_iv_sel</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>se_aes_0_block_mode</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_aes_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_aes_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_aes_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_aes_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_aes_0_hw_key_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>se_aes_0_dec_key_sel</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>se_aes_0_dec_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>se_aes_0_mode</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>se_aes_0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_aes_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_aes_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_msa</name>
						<description>se_aes_0_msa.</description>
						<addressOffset>0x104</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_msa</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_mda</name>
						<description>se_aes_0_mda.</description>
						<addressOffset>0x108</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_mda</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_status</name>
						<description>se_aes_0_status.</description>
						<addressOffset>0x10C</addressOffset>
						<resetValue>0x00000100</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_aes_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_0</name>
						<description>se_aes_0_iv_0.</description>
						<addressOffset>0x110</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_iv_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_1</name>
						<description>se_aes_0_iv_1.</description>
						<addressOffset>0x114</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_iv_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_2</name>
						<description>se_aes_0_iv_2.</description>
						<addressOffset>0x118</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_iv_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_iv_3</name>
						<description>se_aes_0_iv_3.</description>
						<addressOffset>0x11C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_iv_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_0</name>
						<description>se_aes_0_key_0.</description>
						<addressOffset>0x120</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_1</name>
						<description>se_aes_0_key_1.</description>
						<addressOffset>0x124</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_2</name>
						<description>se_aes_0_key_2.</description>
						<addressOffset>0x128</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_3</name>
						<description>se_aes_0_key_3.</description>
						<addressOffset>0x12C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_4</name>
						<description>se_aes_0_key_4.</description>
						<addressOffset>0x130</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_5</name>
						<description>se_aes_0_key_5.</description>
						<addressOffset>0x134</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_6</name>
						<description>se_aes_0_key_6.</description>
						<addressOffset>0x138</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_7</name>
						<description>se_aes_0_key_7.</description>
						<addressOffset>0x13C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_sel_0</name>
						<description>se_aes_0_key_sel_0.</description>
						<addressOffset>0x140</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_sel_0</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_key_sel_1</name>
						<description>se_aes_0_key_sel_1.</description>
						<addressOffset>0x144</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_key_sel_1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
