bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>se_aes_0_endian</name>
						<description>se_aes_0_endian.</description>
						<addressOffset>0x148</addressOffset>
						<resetValue>0x0000000f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_ctr_len</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_aes_0_iv_endian</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_aes_0_key_endian</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_aes_0_din_endian</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_aes_0_dout_endian</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_sboot</name>
						<description>se_aes_0_sboot.</description>
						<addressOffset>0x14C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_sboot_key_sel</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_link</name>
						<description>se_aes_0_link.</description>
						<addressOffset>0x150</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_0_lca</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_aes_0_ctrl_prot</name>
						<description>se_aes_0_ctrl_prot.</description>
						<addressOffset>0x1FC</addressOffset>
						<resetValue>0x00000007</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_aes_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_aes_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_aes_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_0</name>
						<description>se_trng_0_ctrl_0.</description>
						<addressOffset>0x200</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_trng_0_manual_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_trng_0_manual_reseed</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>se_trng_0_manual_fun_sel</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_trng_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_trng_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_trng_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_trng_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_trng_0_ht_error</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_trng_0_dout_clr_1t</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_trng_0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_trng_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_trng_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_status</name>
						<description>se_trng_0_status.</description>
						<addressOffset>0x204</addressOffset>
						<resetValue>0x00100020</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_0</name>
						<description>se_trng_0_dout_0.</description>
						<addressOffset>0x208</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_1</name>
						<description>se_trng_0_dout_1.</description>
						<addressOffset>0x20C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_2</name>
						<description>se_trng_0_dout_2.</description>
						<addressOffset>0x210</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_3</name>
						<description>se_trng_0_dout_3.</description>
						<addressOffset>0x214</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_4</name>
						<description>se_trng_0_dout_4.</description>
						<addressOffset>0x218</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_5</name>
						<description>se_trng_0_dout_5.</description>
						<addressOffset>0x21C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_6</name>
						<description>se_trng_0_dout_6.</description>
						<addressOffset>0x220</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_dout_7</name>
						<description>se_trng_0_dout_7.</description>
						<addressOffset>0x224</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_dout_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_test</name>
						<description>se_trng_0_test.</description>
						<addressOffset>0x228</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_trng_0_ht_alarm_n</name>
								<lsb>4</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_trng_0_ht_dis</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_trng_0_cp_bypass</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_trng_0_cp_test_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_trng_0_test_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_1</name>
						<description>se_trng_0_ctrl_1.</description>
						<addressOffset>0x22C</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_trng_0_reseed_n_lsb</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_2</name>
						<description>se_trng_0_ctrl_2.</description>
						<addressOffset>0x230</addressOffset>
						<resetValue>0x000000ff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_trng_0_reseed_n_msb</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_3</name>
						<description>se_trng_0_ctrl_3.</description>
						<addressOffset>0x234</addressOffset>
						<resetValue>0x837a4203</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_trng_0_rosc_dis</name>
								<lsb>31</lsb>
								<msb>31</msb>
								<description>Used to be called 'se_trng_0_rosc_en', but the SDK calls it 'se_trng_0_rosc_dis'.</description>
							</field>
							<field>
								<name>se_trng_0_ht_od_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>se_trng_0_ht_apt_c</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>se_trng_0_ht_rct_c</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_trng_0_cp_ratio</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_test_out_0</name>
						<description>se_trng_0_test_out_0.</description>
						<addressOffset>0x240</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_test_out_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_test_out_1</name>
						<description>se_trng_0_test_out_1.</description>
						<addressOffset>0x244</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_test_out_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_test_out_2</name>
						<description>se_trng_0_test_out_2.</description>
						<addressOffset>0x248</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_test_out_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_test_out_3</name>
						<description>se_trng_0_test_out_3.</description>
						<addressOffset>0x24C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_trng_0_test_out_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_trng_0_ctrl_prot</name>
						<description>se_trng_0_ctrl_prot.</description>
						<addressOffset>0x2FC</addressOffset>
						<resetValue>0x00000007</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_trng_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_trng_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_trng_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_pka_0_ctrl_0</name>
						<description>se_pka_0_ctrl_0.</description>
						<addressOffset>0x300</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_pka_0_status</name>
								<lsb>17</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_pka_0_status_clr_1t</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>se_pka_0_ram_clr_md</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_pka_0_endian</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>se_pka_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_pka_0_int_set</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_pka_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_pka_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_pka_0_prot_md</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>se_pka_0_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_pka_0_busy</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_pka_0_done_clr_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_pka_0_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>se_pka_0_seed</name>
						<description>se_pka_0_seed.</description>
						<addressOffset>0x30C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_pka_0_seed</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_pka_0_ctrl_1</name>
						<description>se_pka_0_ctrl_1.</description>
						<addressOffset>0x310</addressOffset>
						<resetValue>0x00000005</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_pka_0_hbypass</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>se_pka_0_hburst</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_pka_0_rw</name>
						<description>se_pka_0_rw.</description>
						<addressOffset>0x340</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>se_pka_0_rw_burst</name>
						<description>se_pka_0_rw_burst.</description>
						<addressOffset>0x360</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>se_pka_0_ctrl_prot</name>
						<description>se_pka_0_ctrl_prot.</description>
						<addressOffset>0x3FC</addressOffset>
						<resetValue>0x00000007</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_pka_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_pka_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_pka_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_cdet_0_ctrl_0</name>
						<description>se_cdet_0_ctrl_0.</description>
						<addressOffset>0x400</addressOffset>
						<resetValue>0x21640004</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_cdet_0_g_loop_min</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_cdet_0_g_loop_max</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>se_cdet_0_status</name>
								<lsb>2</lsb>
								<msb>15</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_cdet_0_error</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_cdet_0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_cdet_0_ctrl_1</name>
						<description>se_cdet_0_ctrl_1.</description>
						<addressOffset>0x404</addressOffset>
						<resetValue>0x00ff0332</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_cdet_0_g_slp_n</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>se_cdet_0_t_dly_n</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>se_cdet_0_t_loop_n</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_cdet_0_ctrl_prot</name>
						<description>se_cdet_0_ctrl_prot.</description>
						<addressOffset>0x4FC</addressOffset>
						<resetValue>0x00000007</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_cdet_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_cdet_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_cdet_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_gmac_0_ctrl_0</name>
						<description>se_gmac_0_ctrl_0.</description>
						<addressOffset>0x500</addressOffset>
						<resetValue>0x00007000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_gmac_0_x_endian</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>se_gmac_0_h_endian</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_gmac_0_t_endian</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>se_gmac_0_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>se_gmac_0_int_set_1t</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_gmac_0_int_clr_1t</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_gmac_0_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>se_gmac_0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_gmac_0_trig_1t</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_gmac_0_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>se_gmac_0_lca</name>
						<description>se_gmac_0_lca.</description>
						<addressOffset>0x504</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_gmac_0_lca</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_gmac_0_status</name>
						<description>se_gmac_0_status.</description>
						<addressOffset>0x508</addressOffset>
						<resetValue>0xf1000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_gmac_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_gmac_0_ctrl_prot</name>
						<description>se_gmac_0_ctrl_prot.</description>
						<addressOffset>0x5FC</addressOffset>
						<resetValue>0x00000007</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>se_gmac_id1_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_gmac_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_gmac_prot_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_ctrl_prot_rd</name>
						<description>se_ctrl_prot_rd.</description>
						<addressOffset>0xF00</addressOffset>
						<resetValue>0x00777777</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>se_dbg_dis</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>se_gmac_id1_en_rd</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>se_gmac_id0_en_rd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>se_gmac_prot_en_rd</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>se_cdet_id1_en_rd</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>se_cdet_id0_en_rd</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>se_cdet_prot_en_rd</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>se_pka_id1_en_rd</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>se_pka_id0_en_rd</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>se_pka_prot_en_rd</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>se_trng_id1_en_rd</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>se_trng_id0_en_rd</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>se_trng_prot_en_rd</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>se_aes_id1_en_rd</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>se_aes_id0_en_rd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>se_aes_prot_en_rd</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>se_sha_id1_en_rd</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>se_sha_id0_en_rd</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>se_sha_prot_en_rd</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
