bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>se_ctrl_reserved_0</name>
						<description>se_ctrl_reserved_0.</description>
						<addressOffset>0xF04</addressOffset>
						<fields>
							<field>
								<name>se_ctrl_reserved_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_ctrl_reserved_1</name>
						<description>se_ctrl_reserved_1.</description>
						<addressOffset>0xF08</addressOffset>
						<fields>
							<field>
								<name>se_ctrl_reserved_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>se_ctrl_reserved_2</name>
						<description>se_ctrl_reserved_2.</description>
						<addressOffset>0xF0C</addressOffset>
						<fields>
							<field>
								<name>se_ctrl_reserved_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>TZC_SEC</name>
				<description>TZC_SEC.</description>
				<baseAddress>0x40005000</baseAddress>
				<groupName>TZC_SEC</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>tzc_rom_ctrl</name>
						<description>tzc_rom_ctrl.</description>
						<addressOffset>0x40</addressOffset>
						<resetValue>0x00000f0f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>tzc_sboot_done</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id1_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id1_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id1_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id1_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id0_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r0</name>
						<description>tzc_rom0_r0.</description>
						<addressOffset>0x44</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>tzc_rom0_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r1</name>
						<description>tzc_rom0_r1.</description>
						<addressOffset>0x48</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>tzc_rom0_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r0</name>
						<description>tzc_rom1_r0.</description>
						<addressOffset>0x4C</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>tzc_rom1_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r1</name>
						<description>tzc_rom1_r1.</description>
						<addressOffset>0x50</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>tzc_rom1_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>TZC_NSEC</name>
				<description>TZC_NSEC.</description>
				<baseAddress>0x40006000</baseAddress>
				<groupName>TZC_NSEC</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>tzc_rom_ctrl</name>
						<description>tzc_rom_ctrl.</description>
						<addressOffset>0x40</addressOffset>
						<resetValue>0x00000f0f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_sboot_done</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id1_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id1_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id1_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id1_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id0_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r0</name>
						<description>tzc_rom0_r0.</description>
						<addressOffset>0x44</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_rom0_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r1</name>
						<description>tzc_rom0_r1.</description>
						<addressOffset>0x48</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_rom0_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r0</name>
						<description>tzc_rom1_r0.</description>
						<addressOffset>0x4C</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_rom1_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r1</name>
						<description>tzc_rom1_r1.</description>
						<addressOffset>0x50</addressOffset>
						<resetValue>0x0000ffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>tzc_rom1_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
