bouffalolab/bl-pac/bl602/bl602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>EF_DATA_1</name>
				<description>EF_DATA_1.</description>
				<baseAddress>0x40007080</baseAddress>
				<groupName>EF_DATA_1</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x64</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>reg_key_slot_6_w0</name>
						<description>reg_key_slot_6_w0.</description>
						<addressOffset>0x00</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_6_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_6_w1</name>
						<description>reg_key_slot_6_w1.</description>
						<addressOffset>0x04</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_6_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_6_w2</name>
						<description>reg_key_slot_6_w2.</description>
						<addressOffset>0x08</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_6_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_6_w3</name>
						<description>reg_key_slot_6_w3.</description>
						<addressOffset>0x0C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_6_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w0</name>
						<description>reg_key_slot_7_w0.</description>
						<addressOffset>0x10</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_7_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w1</name>
						<description>reg_key_slot_7_w1.</description>
						<addressOffset>0x14</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_7_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w2</name>
						<description>reg_key_slot_7_w2.</description>
						<addressOffset>0x18</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_7_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w3</name>
						<description>reg_key_slot_7_w3.</description>
						<addressOffset>0x1C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_7_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w0</name>
						<description>reg_key_slot_8_w0.</description>
						<addressOffset>0x20</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_8_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w1</name>
						<description>reg_key_slot_8_w1.</description>
						<addressOffset>0x24</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_8_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w2</name>
						<description>reg_key_slot_8_w2.</description>
						<addressOffset>0x28</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_8_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w3</name>
						<description>reg_key_slot_8_w3.</description>
						<addressOffset>0x2C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_8_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w0</name>
						<description>reg_key_slot_9_w0.</description>
						<addressOffset>0x30</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_9_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w1</name>
						<description>reg_key_slot_9_w1.</description>
						<addressOffset>0x34</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_9_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w2</name>
						<description>reg_key_slot_9_w2.</description>
						<addressOffset>0x38</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_9_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w3</name>
						<description>reg_key_slot_9_w3.</description>
						<addressOffset>0x3C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>reg_key_slot_9_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_10_w0</name>
						<description>reg_key_slot_10_w0.</description>
						<addressOffset>0x40</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_10_w1</name>
						<description>reg_key_slot_10_w1.</description>
						<addressOffset>0x44</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_10_w2</name>
						<description>reg_key_slot_10_w2.</description>
						<addressOffset>0x48</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_10_w3</name>
						<description>reg_key_slot_10_w3.</description>
						<addressOffset>0x4C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_11_w0</name>
						<description>reg_key_slot_11_w0.</description>
						<addressOffset>0x50</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_11_w1</name>
						<description>reg_key_slot_11_w1.</description>
						<addressOffset>0x54</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_11_w2</name>
						<description>reg_key_slot_11_w2.</description>
						<addressOffset>0x58</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_key_slot_11_w3</name>
						<description>reg_key_slot_11_w3.</description>
						<addressOffset>0x5C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
					</register>
					<register>
						<name>reg_data_1_lock</name>
						<description>reg_data_1_lock.</description>
						<addressOffset>0x60</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rd_lock_key_slot_9</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_8</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_7</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_6</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>RESERVED_25_16</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_9</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_8</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_7</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_6</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>RESERVED_9_0</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
