bouffalolab/bl-pac/bl602/bl602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>EF_CTRL</name>
				<description>eFuse memory control</description>
				<baseAddress>0x40007800</baseAddress>
				<groupName>EF_CTRL</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x218</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>ef_if_ctrl_0</name>
						<description>ef_if_ctrl_0.</description>
						<addressOffset>0x000</addressOffset>
						<resetValue>0x00240003</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_prot_code_cyc</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_if_0_int_set</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ef_if_0_int_clr</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ef_if_0_int</name>
								<lsb>20</lsb>
								<msb>20</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ef_if_cyc_modify_lock</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ef_if_auto_rd_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ef_clk_sahb_data_gate</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ef_if_por_dig</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ef_if_prot_code_ctrl</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ef_clk_sahb_data_sel</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ef_if_0_cyc_modify</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ef_if_0_manual_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ef_if_0_trig</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ef_if_0_rw</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ef_if_0_busy</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ef_if_0_autoload_done</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ef_if_0_autoload_p1_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_cyc_0</name>
						<description>ef_if_cyc_0.</description>
						<addressOffset>0x004</addressOffset>
						<resetValue>0x16000040</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_cyc_pd_cs_s</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_if_cyc_cs</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ef_if_cyc_rd_adr</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ef_if_cyc_rd_dat</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ef_if_cyc_rd_dmy</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_cyc_1</name>
						<description>ef_if_cyc_1.</description>
						<addressOffset>0x008</addressOffset>
						<resetValue>0x00206609</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_cyc_pd_cs_h</name>
								<lsb>26</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_if_cyc_ps_cs</name>
								<lsb>20</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ef_if_cyc_wr_adr</name>
								<lsb>14</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ef_if_cyc_pp</name>
								<lsb>6</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ef_if_cyc_pi</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_0_manual</name>
						<description>ef_if_0_manual.</description>
						<addressOffset>0x00C</addressOffset>
						<resetValue>0x0000e400</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_prot_code_manual</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_if_0_q</name>
								<lsb>16</lsb>
								<msb>23</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ef_if_csb</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ef_if_load</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ef_if_pgenb</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ef_if_strobe</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ef_if_ps</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ef_if_pd</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ef_if_a</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_0_status</name>
						<description>ef_if_0_status.</description>
						<addressOffset>0x010</addressOffset>
						<resetValue>0x0000e400</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_0_status</name>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_cfg_0</name>
						<description>ef_if_cfg_0.</description>
						<addressOffset>0x014</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>ef_if_dbg_mode</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_if_dbg_jtag_0_dis</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ef_if_dbg_jtag_1_dis</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ef_if_efuse_dbg_dis</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ef_if_se_dbg_dis</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ef_if_cpu_rst_dbg_dis</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ef_if_cpu1_dis</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ef_if_sf_dis</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ef_if_cam_dis</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ef_if_0_key_enc_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ef_if_wifi_dis</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ef_if_ble_dis</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ef_if_sdu_dis</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ef_if_sw_usage_1</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ef_if_boot_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ef_if_cpu0_enc_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ef_if_cpu1_enc_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ef_if_sboot_en</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ef_if_sboot_sign_mode</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ef_if_sf_aes_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_sw_cfg_0</name>
						<description>ef_sw_cfg_0.</description>
						<addressOffset>0x018</addressOffset>
						<fields>
							<field>
								<name>ef_sw_dbg_mode</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_sw_dbg_jtag_0_dis</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ef_sw_dbg_jtag_1_dis</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ef_sw_efuse_dbg_dis</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ef_sw_se_dbg_dis</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ef_sw_cpu_rst_dbg_dis</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ef_sw_cpu1_dis</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ef_sw_sf_dis</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ef_sw_cam_dis</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ef_sw_0_key_enc_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ef_sw_wifi_dis</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ef_sw_ble_dis</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ef_sw_sdu_dis</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ef_sw_sw_usage_1</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ef_sw_cpu0_enc_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ef_sw_cpu1_enc_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ef_sw_sboot_en</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ef_sw_sboot_sign_mode</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ef_sw_sf_aes_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_reserved</name>
						<description>ef_reserved.</description>
						<addressOffset>0x01C</addressOffset>
						<fields>
							<field>
								<name>ef_reserved</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_ana_trim_0</name>
						<description>ef_if_ana_trim_0.</description>
						<addressOffset>0x020</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_ana_trim_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_if_sw_usage_0</name>
						<description>ef_if_sw_usage_0.</description>
						<addressOffset>0x024</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_if_sw_usage_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_crc_ctrl_0</name>
						<description>ef_crc_ctrl_0.</description>
						<addressOffset>0x200</addressOffset>
						<resetValue>0x00ff0224</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_crc_slp_n</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ef_crc_lock</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ef_crc_int_set</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ef_crc_int_clr</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ef_crc_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ef_crc_din_endian</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ef_crc_dout_endian</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ef_crc_dout_inv_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ef_crc_error</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ef_crc_mode</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ef_crc_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ef_crc_trig</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ef_crc_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_crc_ctrl_1</name>
						<description>ef_crc_ctrl_1.</description>
						<addressOffset>0x204</addressOffset>
						<resetValue>0xffffffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_crc_data_0_en</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_crc_ctrl_2</name>
						<description>ef_crc_ctrl_2.</description>
						<addressOffset>0x208</addressOffset>
						<resetValue>0xffffffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_crc_data_1_en</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_crc_ctrl_3</name>
						<description>ef_crc_ctrl_3.</description>
						<addressOffset>0x20C</addressOffset>
						<resetValue>0xffffffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_crc_iv</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_crc_ctrl_4</name>
						<description>ef_crc_ctrl_4.</description>
						<addressOffset>0x210</addressOffset>
						<resetValue>0xc2a8fa9d</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_crc_golden</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ef_crc_ctrl_5</name>
						<description>ef_crc_ctrl_5.</description>
						<addressOffset>0x214</addressOffset>
						<resetValue>0xffffffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ef_crc_dout</name>
								<lsb>0</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
