bouffalolab/bl-pac/bl602/bl602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>SPI</name>
				<description>SPI master / slave control</description>
				<baseAddress>0x4000A200</baseAddress>
				<groupName>SPI</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x90</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>spi_config</name>
						<description>spi_config.</description>
						<addressOffset>0x0</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_spi_deg_cnt</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_spi_deg_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_spi_m_cont_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_spi_rxd_ignr_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_spi_byte_inv</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_spi_bit_inv</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_spi_sclk_ph</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_spi_sclk_pol</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_spi_frame_size</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_spi_s_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_spi_m_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_int_sts</name>
						<description>spi_int_sts.</description>
						<addressOffset>0x4</addressOffset>
						<resetValue>0x3f003f00</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_spi_fer_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_spi_txu_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>cr_spi_sto_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_spi_rxf_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>cr_spi_txf_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>cr_spi_end_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rsvd_21</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_spi_txu_clr</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_spi_sto_clr</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rsvd_18</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rsvd_17</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_spi_end_clr</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_spi_fer_mask</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_spi_txu_mask</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_spi_sto_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_spi_rxf_mask</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_spi_txf_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_spi_end_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>spi_fer_int</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>spi_txu_int</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>spi_sto_int</name>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>spi_rxf_int</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>spi_txf_int</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>spi_end_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_bus_busy</name>
						<description>spi_bus_busy.</description>
						<addressOffset>0x8</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>sts_spi_bus_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_prd_0</name>
						<description>spi_prd_0.</description>
						<addressOffset>0x10</addressOffset>
						<resetValue>0x0f0f0f0f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_spi_prd_d_ph_1</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_spi_prd_d_ph_0</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_spi_prd_p</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_spi_prd_s</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_prd_1</name>
						<description>spi_prd_1.</description>
						<addressOffset>0x14</addressOffset>
						<resetValue>0x0000000f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_spi_prd_i</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_rxd_ignr</name>
						<description>spi_rxd_ignr.</description>
						<addressOffset>0x18</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_spi_rxd_ignr_s</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_spi_rxd_ignr_p</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_sto_value</name>
						<description>spi_sto_value.</description>
						<addressOffset>0x1C</addressOffset>
						<resetValue>0x00000fff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_spi_sto_value</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_fifo_config_0</name>
						<description>spi_fifo_config_0.</description>
						<addressOffset>0x80</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>spi_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>spi_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_fifo_config_1</name>
						<description>spi_fifo_config_1.</description>
						<addressOffset>0x84</addressOffset>
						<resetValue>0x00000004</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rx_fifo_th</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tx_fifo_th</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rx_fifo_cnt</name>
								<lsb>8</lsb>
								<msb>10</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_fifo_wdata</name>
						<description>spi_fifo_wdata.</description>
						<addressOffset>0x88</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>write-only</access>
						<fields>
							<field>
								<name>spi_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>spi_fifo_rdata</name>
						<description>spi_fifo_rdata.</description>
						<addressOffset>0x8C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>spi_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
