bouffalolab/bl-pac/bl602/bl602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>I2C</name>
				<description>I2C control</description>
				<baseAddress>0x4000A300</baseAddress>
				<groupName>I2C</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x100</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>i2c_config</name>
						<description>i2c_config.</description>
						<addressOffset>0x0</addressOffset>
						<resetValue>0x0000000a</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_deg_cnt</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_i2c_pkt_len</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_i2c_slv_addr</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_i2c_sub_addr_bc</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_i2c_sub_addr_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_i2c_scl_sync_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_i2c_deg_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_i2c_pkt_dir</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_i2c_m_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_int_sts</name>
						<description>i2c_int_sts.</description>
						<addressOffset>0x4</addressOffset>
						<resetValue>0x3f003f00</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_fer_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_i2c_arb_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>cr_i2c_nak_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_i2c_rxf_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>cr_i2c_txf_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>cr_i2c_end_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rsvd_21</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_i2c_arb_clr</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_i2c_nak_clr</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rsvd_18</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rsvd_17</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_i2c_end_clr</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_i2c_fer_mask</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_i2c_arb_mask</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_i2c_nak_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_i2c_rxf_mask</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_i2c_txf_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_i2c_end_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>i2c_fer_int</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>i2c_arb_int</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>i2c_nak_int</name>
								<lsb>3</lsb>
								<msb>3</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>i2c_rxf_int</name>
								<lsb>2</lsb>
								<msb>2</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>i2c_txf_int</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>i2c_end_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_sub_addr</name>
						<description>i2c_sub_addr.</description>
						<addressOffset>0x8</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_sub_addr_b3</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_i2c_sub_addr_b2</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_i2c_sub_addr_b1</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_i2c_sub_addr_b0</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_bus_busy</name>
						<description>i2c_bus_busy.</description>
						<addressOffset>0xC</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_bus_busy_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sts_i2c_bus_busy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_prd_start</name>
						<description>i2c_prd_start.</description>
						<addressOffset>0x10</addressOffset>
						<resetValue>0x0f0f0f0f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_prd_s_ph_3</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_i2c_prd_s_ph_2</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_i2c_prd_s_ph_1</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_i2c_prd_s_ph_0</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_prd_stop</name>
						<description>i2c_prd_stop.</description>
						<addressOffset>0x14</addressOffset>
						<resetValue>0x0f0f0f0f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_prd_p_ph_3</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_i2c_prd_p_ph_2</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_i2c_prd_p_ph_1</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_i2c_prd_p_ph_0</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_prd_data</name>
						<description>i2c_prd_data.</description>
						<addressOffset>0x18</addressOffset>
						<resetValue>0x0f0f0f0f</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>cr_i2c_prd_d_ph_3</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_i2c_prd_d_ph_2</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_i2c_prd_d_ph_1</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_i2c_prd_d_ph_0</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_fifo_config_0</name>
						<description>i2c_fifo_config_0.</description>
						<addressOffset>0x80</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>i2c_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>i2c_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_fifo_config_1</name>
						<description>i2c_fifo_config_1.</description>
						<addressOffset>0x84</addressOffset>
						<resetValue>0x00000002</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>rx_fifo_th</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tx_fifo_th</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rx_fifo_cnt</name>
								<lsb>8</lsb>
								<msb>9</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_fifo_wdata</name>
						<description>i2c_fifo_wdata.</description>
						<addressOffset>0x88</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>write-only</access>
						<fields>
							<field>
								<name>i2c_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>i2c_fifo_rdata</name>
						<description>i2c_fifo_rdata.</description>
						<addressOffset>0x8C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<access>read-only</access>
						<fields>
							<field>
								<name>i2c_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
