bouffalolab/bl-pac/bl602/bl602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>AON</name>
				<description>Always-ON periherals</description>
				<baseAddress>0x40010000</baseAddress>
				<groupName>AON</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x144</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>aon</name>
						<description>aon.</description>
						<addressOffset>0x000</addressOffset>
						<resetValue>0x00400000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>sw_pu_ldo11_rt</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ldo11_rt_pulldown_sel</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ldo11_rt_pulldown</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_aon_dc_tbuf</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>aon_resv</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>aon_common</name>
						<description>aon_common.</description>
						<addressOffset>0x004</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ten_cip_misc_aon</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ten_mbg_aon</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>dten_xtal_aon</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ten_xtal_aon</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ten_ldo15rf_aon</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ten_bg_sys_aon</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ten_dcdc18_1_aon</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ten_dcdc18_0_aon</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ten_ldo11soc_aon</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ten_vddcore_aon</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>ten_xtal32k</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>dten_xtal32k</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ten_aon</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>tmux_aon</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>aon_misc</name>
						<description>aon_misc.</description>
						<addressOffset>0x008</addressOffset>
						<resetValue>0x00000003</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>sw_wb_en_aon</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sw_soc_en_aon</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>bg_sys_top</name>
						<description>bg_sys_top.</description>
						<addressOffset>0x010</addressOffset>
						<resetValue>0x00001100</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>bg_sys_start_ctrl_aon</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_bg_sys_aon</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pmip_resv</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dcdc18_top_0</name>
						<description>dcdc18_top_0.</description>
						<addressOffset>0x014</addressOffset>
						<resetValue>0x8a580736</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>dcdc18_rdy_aon</name>
								<lsb>31</lsb>
								<msb>31</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>dcdc18_sstart_time_aon</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>dcdc18_osc_inhibit_t2_aon</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>dcdc18_slow_osc_aon</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>dcdc18_stop_osc_aon</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>dcdc18_slope_curr_sel_aon</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>dcdc18_osc_freq_trim_aon</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>dcdc18_osc_2m_mode_aon</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dcdc18_vpfm_aon</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>dcdc18_vout_sel_aon</name>
								<lsb>1</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dcdc18_top_1</name>
						<description>dcdc18_top_1.</description>
						<addressOffset>0x018</addressOffset>
						<resetValue>0x18180048</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>dcdc18_pulldown_aon</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>dcdc18_en_antiring_aon</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>dcdc18_cfb_sel_aon</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>dcdc18_chf_sel_aon</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>dcdc18_rc_sel_aon</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>dcdc18_nonoverlap_td_aon</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dcdc18_zvs_td_opt_aon</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>dcdc18_cs_delay_aon</name>
								<lsb>1</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dcdc18_force_cs_zvs_aon</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ldo11soc_and_dctest</name>
						<description>ldo11soc_and_dctest.</description>
						<addressOffset>0x01C</addressOffset>
						<resetValue>0x70001811</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>pmip_dc_tp_out_en_aon</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>pu_vddcore_misc_aon</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ldo11soc_power_good_aon</name>
								<lsb>29</lsb>
								<msb>29</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ldo11soc_rdy_aon</name>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>ldo11soc_cc_aon</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ldo11soc_vth_sel_aon</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ldo11soc_pulldown_sel_aon</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ldo11soc_pulldown_aon</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ldo11soc_sstart_delay_aon</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ldo11soc_sstart_sel_aon</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_ldo11soc_aon</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>psw_irrcv</name>
						<description>psw_irrcv.</description>
						<addressOffset>0x020</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>pu_ir_psw_aon</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_top_aon</name>
						<description>rf_top_aon.</description>
						<addressOffset>0x080</addressOffset>
						<resetValue>0x00020137</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>ldo15rf_bypass_aon</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>ldo15rf_cc_aon</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ldo15rf_vout_sel_aon</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ldo15rf_pulldown_sel_aon</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ldo15rf_pulldown_aon</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ldo15rf_sstart_delay_aon</name>
								<lsb>9</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ldo15rf_sstart_sel_aon</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pu_xtal_aon</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_xtal_buf_aon</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_sfreg_aon</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_ldo15rf_aon</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>pu_mbg_aon</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>xtal_cfg</name>
						<description>xtal_cfg.</description>
						<addressOffset>0x084</addressOffset>
						<resetValue>0xb410f0f0</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>xtal_rdy_sel_aon</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>xtal_gm_boost_aon</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>xtal_capcode_in_aon</name>
								<lsb>22</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>xtal_capcode_out_aon</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>xtal_amp_ctrl_aon</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>xtal_sleep_aon</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>xtal_fast_startup_aon</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>xtal_buf_hp_aon</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>xtal_buf_en_aon</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>xtal_ext_sel_aon</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>xtal_capcode_extra_aon</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>xtal_bk_aon</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tsen</name>
						<description>tsen.</description>
						<addressOffset>0x088</addressOffset>
						<resetValue>0x78ff08ff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>xtal_rdy_int_sel_aon</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>xtal_inn_cfg_en_aon</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>xtal_rdy</name>
								<lsb>28</lsb>
								<msb>28</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>tsen_refcode_rfcal</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tsen_refcode_corner</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>acomp0_ctrl</name>
						<description>acomp0_ctrl.</description>
						<addressOffset>0x100</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>acomp0_muxen</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>acomp0_pos_sel</name>
								<lsb>22</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>acomp0_neg_sel</name>
								<lsb>18</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>acomp0_level_sel</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>acomp0_bias_prog</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>acomp0_hyst_selp</name>
								<lsb>7</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>acomp0_hyst_seln</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>acomp0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>acomp1_ctrl</name>
						<description>acomp1_ctrl.</description>
						<addressOffset>0x104</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>acomp1_muxen</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>acomp1_pos_sel</name>
								<lsb>22</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>acomp1_neg_sel</name>
								<lsb>18</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>acomp1_level_sel</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>acomp1_bias_prog</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>acomp1_hyst_selp</name>
								<lsb>7</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>acomp1_hyst_seln</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>acomp1_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>acomp_ctrl</name>
						<description>acomp_ctrl.</description>
						<addressOffset>0x108</addressOffset>
						<resetValue>0x00000003</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>acomp_reserved</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>acomp0_out_raw</name>
								<lsb>19</lsb>
								<msb>19</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>acomp1_out_raw</name>
								<lsb>17</lsb>
								<msb>17</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>acomp0_test_sel</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>acomp1_test_sel</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>acomp0_test_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>acomp1_test_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>acomp0_rstn_ana</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>acomp1_rstn_ana</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_cmd</name>
						<description>gpadc_reg_cmd.</description>
						<addressOffset>0x10C</addressOffset>
						<resetValue>0x00000f78</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_sen_test_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gpadc_sen_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gpadc_chip_sen_pu</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>gpadc_micboost_32db_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gpadc_mic_pga2_gain</name>
								<lsb>21</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gpadc_mic1_diff</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>gpadc_mic2_diff</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpadc_dwa_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>gpadc_byp_micboost</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>gpadc_micpga_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>gpadc_micbias_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_neg_gnd</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gpadc_pos_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>gpadc_neg_sel</name>
								<lsb>3</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gpadc_soft_rst</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>gpadc_conv_start</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpadc_global_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_config1</name>
						<description>gpadc_reg_config1.</description>
						<addressOffset>0x110</addressOffset>
						<resetValue>0x000c0002</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_v18_sel</name>
								<lsb>29</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gpadc_v11_sel</name>
								<lsb>27</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>gpadc_dither_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gpadc_scan_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gpadc_scan_length</name>
								<lsb>21</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_clk_div_ratio</name>
								<lsb>18</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>gpadc_clk_ana_inv</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gpadc_res_sel</name>
								<lsb>2</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gpadc_cont_conv_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpadc_cal_os_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_config2</name>
						<description>gpadc_reg_config2.</description>
						<addressOffset>0x114</addressOffset>
						<resetValue>0x00019100</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_tsvbe_low</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_dly_sel</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gpadc_pga1_gain</name>
								<lsb>25</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>gpadc_pga2_gain</name>
								<lsb>22</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_test_sel</name>
								<lsb>19</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>gpadc_test_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>gpadc_bias_sel</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gpadc_chop_mode</name>
								<lsb>15</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>gpadc_pga_vcmi_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_pga_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gpadc_pga_os_cal</name>
								<lsb>9</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>gpadc_pga_vcm</name>
								<lsb>7</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpadc_ts_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gpadc_tsext_sel</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpadc_vbat_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gpadc_vref_sel</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>gpadc_diff_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_scn_pos1</name>
						<description>adc converation sequence 1</description>
						<addressOffset>0x118</addressOffset>
						<resetValue>0x1ef7bdef</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_scan_pos_5</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_4</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_3</name>
								<lsb>15</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_2</name>
								<lsb>10</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_1</name>
								<lsb>5</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_0</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
