bouffalolab/bl-pac/bl602/bl602.svd
					<register>
						<name>gpadc_reg_scn_pos2</name>
						<description>adc converation sequence 2</description>
						<addressOffset>0x11C</addressOffset>
						<resetValue>0x1ef7bdef</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_scan_pos_11</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_10</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_9</name>
								<lsb>15</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_8</name>
								<lsb>10</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_7</name>
								<lsb>5</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_scan_pos_6</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_scn_neg1</name>
						<description>adc converation sequence 3</description>
						<addressOffset>0x120</addressOffset>
						<resetValue>0x1ef7bdef</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_scan_neg_5</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_4</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_3</name>
								<lsb>15</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_2</name>
								<lsb>10</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_1</name>
								<lsb>5</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_0</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_scn_neg2</name>
						<description>adc converation sequence 4</description>
						<addressOffset>0x124</addressOffset>
						<resetValue>0x1ef7bdef</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_scan_neg_11</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_10</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_9</name>
								<lsb>15</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_8</name>
								<lsb>10</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_7</name>
								<lsb>5</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_6</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_status</name>
						<description>gpadc_reg_status.</description>
						<addressOffset>0x128</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_reserved</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_data_rdy</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_isr</name>
						<description>gpadc_reg_isr.</description>
						<addressOffset>0x12C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_pos_satur_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_neg_satur_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpadc_pos_satur_clr</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpadc_neg_satur_clr</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gpadc_pos_satur</name>
								<lsb>1</lsb>
								<msb>1</msb>
								<access>read-only</access>
							</field>
							<field>
								<name>gpadc_neg_satur</name>
								<lsb>0</lsb>
								<msb>0</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_result</name>
						<description>gpadc_reg_result.</description>
						<addressOffset>0x130</addressOffset>
						<resetValue>0x01ef0000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_data_out</name>
								<lsb>0</lsb>
								<msb>25</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_raw_result</name>
						<description>gpadc_reg_raw_result.</description>
						<addressOffset>0x134</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_raw_data</name>
								<lsb>0</lsb>
								<msb>11</msb>
								<access>read-only</access>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_define</name>
						<description>gpadc_reg_define.</description>
						<addressOffset>0x138</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>gpadc_os_cal_data</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hbncore_resv0</name>
						<description>hbncore_resv0.</description>
						<addressOffset>0x13C</addressOffset>
						<resetValue>0x00000000</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>hbncore_resv0_data</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hbncore_resv1</name>
						<description>hbncore_resv1.</description>
						<addressOffset>0x140</addressOffset>
						<resetValue>0xffffffff</resetValue>
						<resetMask>0xffffffff</resetMask>
						<fields>
							<field>
								<name>hbncore_resv1_data</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
		</peripherals>
	</device>
